In [22]:
import sqlite3
import pandas as pd

In [23]:
def dbConnection():
    return sqlite3.connect("data/example.db")

In [26]:
#example of retrieving data from a sqlite database
with dbConnection() as con:
    cur = con.execute("SELECT id,first_name,last_name,phone_number FROM person")
    print(cur.fetchall())

[(1, 'Kyle', 'Johnsen', ''), (2, 'Andrew', 'Rukangu', ''), (3, 'Brook', 'Bowers', ''), (5, 'Brook', 'Bowers', '')]

In [27]:
#example using pandas read_sql
with dbConnection() as con:
    display(pd.read_sql("SELECT * FROM person",con))

   id first_name last_name phone_number
0   1       Kyle   Johnsen
1   2     Andrew   Rukangu
2   3      Brook    Bowers
3   5      Brook    Bowers

In [33]:
#a more elaborate select example with filtering
with dbConnection() as con:
    df = pd.read_sql("SELECT * FROM person WHERE first_name='Kyle' or id>1",con)
    display(df)

   id first_name last_name  phone_number
0   1       Kyle   Johnsen
1   2     Andrew   Rukangu
2   3      Brook    Bowers
3   5      Brook    Bowers
4   6      Brook    Bowers  555-555-5555

In [32]:
with dbConnection() as con:
    con.execute("INSERT INTO person (first_name,last_name) VALUES (?,?)",('Brook','Bowers'))

In [35]:
with dbConnection() as con:
    con.execute("UPDATE person SET last_name='Johnson' WHERE id=1")
    con.execute("DELETE FROM person WHERE first_name=?",('Brook',))
    df = pd.read_sql("SELECT * FROM person",con)
    display(df)

   id first_name last_name phone_number
0   1       Kyle   Johnson
1   2     Andrew   Rukangu